{
    "BigPenny": "Since people seem to be shy, I will break the ice and throw my hat into the ring. After withdrawing my nomination from the last election and going on a much needed break to evaluate our communities new tokenomics, I feel invigorated to take on an active role on the council and represent our community again. There was a lot of soul searching happening. It’s no secret that I was very skeptical about a no staking, full BBB tokenomics approach but price action is king and I’m not afraid to admit when I was wrong.\n\nMy goal for the upcoming epoch is to continue what has been started with the transition to OVERTIME. While we should be proud of our past, we must also be wise to leave behind everything that has shown to not work, is inefficient or simply not needed anymore. Two of my current proposals are targeting legacy artifacts which we should get rid of: Sunsetting Thalesmarkets and ending the public OVERTIME market LPs. Instead of repeating myself, I invite everyone to read the OIPs here (⁠oip-246-sunset-thalesmarkets) and here (⁠oip-247-end-public-liquidity-pr…) and join the discussion.\n\nLiterally everything in the past 6 months has shown us loud and clear that we must go all in OVERTIME and BBB and I am eager to continue down this path and drive the necessary changes along the way.\n\nIf you like the direction of my proposed changes and want me to represent your interests on the council, then your vote is much appreciated!\n\nbigpenny.eth",
    "Brad | Giraft.io": "Why I’m a Strong Candidate for the Overtime Council\n\nI’ve been deeply engaged with Overtime since July 2022, actively participating in Discord discussions and following the evolution of the protocol. My long-standing conviction in crypto-native sports betting stems from real experience: I’ve been involved in sports betting since 2003 and was one of the early power users of Nitrogen Sports back in 2013. I’ve seen firsthand how Bitcoin revolutionized access to  betting markets—and I believe Overtime is the next chapter.\n\nMy current project, Giraft, is a frontend built specifically to support and grow Overtime. We have put approximately $70k in volume through OT since inception. We don’t compete with the backend—we depend on it. Overtime’s success is our success, which is why we’re deeply invested in helping OT and the entire ecosystem thrive. I am a top 15 HODLer of $OVER.\n\nWhat sets me apart is that I’m not just an early user or a builder—I’m a long-term thinker. I believe decentralized sports betting is one of crypto’s few genuinely mainstream use cases. I bring 20+ years of market knowledge and have several novel, scalable promo strategies designed to drive user acquisition, retention, and a sustainable flywheel of growth.\n\nMy goal on the Council would be to ensure that Overtime stays at the center of the decentralized sports betting landscape—by promoting innovation, liquidity alignment, and community-driven growth.\n\ngiraft.eth - x.com/bradlrt",
    "chaz": "Short, but not-so-short informal introduction - I'm Chaz and I'm a total sportsbetting degenerate. Over the last ~5-6 years I've been throttled, kyc'd, or outright banned from multiple crypto casinos/books. In August of 2023 I happenstanced upon, what in my opinion, was pretty incredible degenerate tech - Bookiebot and being able to sportsbet through a TG dapp. Seemed like the most fitting way to attract crypto-minded individuals and I was all in. Jonny and Junkie built a pretty good platform by utilizing Overtime's and (redacted) backend and it made me a true believer of on-chain sportsbetting. Unforunately (at least for the time being) the project is dead in the water, but the dudes are still great guys and Junkie has even helped me in one way or another clawback some of those kyc'd banned funds from a specific, shady crypto casino. In the mean time, I've dove head first in to Overtime and have popped up here or there over the years. I've brought over some of the last remaining Bookiebot degens and handed out more free bets through twitter than I can count - trying to spread the goodword of on-chain, no-kyc, permisionless sportsbetting\n\nWith all of that said - I'm seeking your votes for a council position because I think I can bring an outsider's perspective to an already burgeoning protocol. I've played around with more than enough crypto books and I can generally see what works and what doesn't. By no means have I effected any true change to Overtime, but through my constant pestering (lol) of Dani, I have seen more than a few changes made that have made an even better on-chain sportsbook. I won't take credit, because I'm not a developer, but seeing live betting on esports, more tiers of events of esports offered, and most recently dynamic rolling start times of UFC matches/events may have something to do with my constant pestering. More recently - I have been giving what help I can on the social media and marketing front of things. Through my personal twitter account and back-and-forth's with Luke, I've tried to spread overtime in to new communities that may or may not know anything about us.\n\nHere's the thing - your average degen sports bettor doesn't know they want to be on-chain until it's too late. With the rebrand and gasless betting - it's easier than ever to convince that same degen that Overtime is where they belong and I believe I can be helpful on the council in bringing more of those degens over.\n\nI'm Chaz, I'm $over alligned, and I'm hoping I can secure your vote. I'm far from a passive user and I can promise I'd be far from a passive council member\n\nCT: https://x.com/LousyDegen\nLousyDegen.eth",
    "1603 | Overtime": "I'm 1603 | Overtime, nominating myself for the upcoming council epoch. As someone who's been building alongside you since nearly the beginning, I bring a unique combination of proven track record and strategic vision for our explosive growth phase.\n\nWhy I'm Running Now 2025 is our breakout year. With Overtime hitting ATH volumes and the bull market accelerating, we need council members who think in decades, not quarters. My multiple implemented whitepapers prove I don't just talk—I deliver innovations that create lasting value.\n\nMy Core Commitments:\n- Self-Sustaining Protocol - I'll champion initiatives that eliminate treasury dependence. A truly decentralized protocol funds itself through revenue, not reserves.\n- OVER Token = #1 Crypto Sports Brand - Coordinated assault on mainstream consciousness. I've been in crypto since 2014—I know what separates winners from forgotten projects.\n- Proven Innovation Pipeline - As your 'idea guy', I've authored multiple whitepapers that became features you use daily. In council, I'll ensure we stay ahead of competitors, not chase them.\n\nWhat Sets Me Apart:\n- Long-term skin in the game - Bitcoin class of 2014. I've survived every cycle and know patience beats hype\n- CC perspective - As head of UX/UI and Growth, I see daily what users want vs. what we deliver\n- Strategic pragmatism - I balance vision with executable roadmaps\n\nI don't promise easy wins—I promise the hard decisions that ensure Overtime dominates for decades. When others think quarters, I think generations.\n\nLet's make Overtime undeniable.\n\nVote: 1603 0xE460C8Fd3d455271819bdf5cf4D56CbBd0996e9D",
    "alert": "I am a experienced bettor who truly understands the needs of sportsbook users—having placed bets with soft bookies, Asian bookmakers, and local retail shops—I recognize what makes a platform attractive and trustworthy.\n\nWhile other, more technical candidates are focusing on the system’s sustainability and ongoing development, I will center my candidacy on representing the interests of bettors and everyday Overtime users.\nPitch: Driving Overtime’s Growth with Strategic Odds Provider Management\n\nReevaluating and Actively Sourcing Odds Providers, Negotiating More Markets, Sports, and Bet Types\n\nEnsure Overtime delivers the most competitive and comprehensive betting experience. This means not only actively searching for new, high-quality odds providers but also regularly reevaluating our current partners to guarantee they meet our standards for reliability, market variety, and pricing. I will proactively negotiate with both existing and new providers to expand our offering—covering more sports, introducing additional markets, and enabling a wider range of bet types.\n\nEngaging with Providers to Expand Betting Markets\n\nBeyond acquiring top providers, I will try to maintain ongoing, direct communication with them to further enrich our betting catalog. By fostering these relationships, we can  introduce innovative bet types, and respond to emerging trends in the sports betting landscape. This flexibility will keep Overtime at the forefront of onchain betting.\n\nIncreasing Betting Volume on OVER within Overtime\n\nIf we succeed in offering a greater variety of bets and enriching the user experience, the adoption and use of Overtime will accelerate significantly. This, in turn, will lead to a much faster increase in betting volume and, consequently, greater short-term sustainability for the system.\n\nVote:  0xfCb6cD5d3164455B4189F05307b4bBD169e09b03",
    "holmberg": "I'm nominating myself up for Council again.\n#OVERTO1$\n\nI have been active Overtime member since early 2023 and currently sit on council. Overtime feels like home to me, and I want to keep building with this project since I think it has huge potential.\n\nDuring last epoches, I have focused on three main areas, and I plan to keep pushing these forward in future epoches also.\n\n1) Helping keep Overtime betting healthy by supporting league selection, liquidity, and other important stuff.\n\n2) Working / suggesting new betting features (like system betting).\n\n3) Making sure competitions stay fair and rewarding for users.\n\n0x6592602fb118a553ea4a10C7f8bec28c4903B296",
    "Svenska": "Hey friends,\n\nFollowing an epoch marked by major milestones, including a full rebranding and the implementation of our BBB model, we are now entering a new one, with a strong focus on user acquisition aimed at establishing Overtime as the leading platform for decentralized sports betting.\n\nWhile governance-related activity is sometimes less visible to everyone and not always fully appreciated, I firmly believe that a strong, reliable governance council remains essential. It ensures accountability, consistency, and alignment with the long-term vision of the protocol.\n\nRecent examples have shown how the absence of such governance structures can harm other protocols, sometimes irreversibly.\n\nIf you choose to place your trust in me again, I will remain fully committed to defending the best interests of all stakeholders. I will continue to engage thoughtfully with every proposal, experiment where needed, and ensure that no OIP goes without review and vote.\n\nThank you for your time.\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "padzank | Overtime": "Greeting Zebros!\n\nRapid growth stage, volume АТH milestones, wide demographic scalability and accessibility; Overtime is doing it's thing FINALLY. Wide recognition for all the work we all put in is imminent. We will become the next paradigm of new age applications.\n\nI hereby nominate myself for another epoch of Overtime Council.\n\nAs an official growth core contributor to the project, I will do my best to tie together all the internal processes of development with the external sentiment and community feedbacks/needs. I believe that the key of progressing from this point onward is cultivating a strong community of permanent users who genuinely love the product, and allow them to help iron out the product and spread the gospel of Overtime. This is where we the council should come in, and be the executive branch between development and sentiment.\n\nAddress: 0x11219d61e95fC5930762b16868dDB2C9c6fc83fA\nENS: padzank.eth"
}
